""""
코딩이란?
하나 이상의 관련된 추상 알고리즘을 특정한 프로그래망 언어를 이용해 구체적인 컴퓨터 프로그램을 구현하는 기술을 말함.

알고리즘 - 수학과 컴퓨터 과학, 언어학 또는 관련 분야이서 어떠한 문제를 해결하기 위해 정해진 일련의 절차나 
 방법을 공식화한 형태로 표현한 것, 계산을 실행하기 위한 단계적 절차
프로그래밍 언어 - 컴퓨터 시스템을 구동시키는 소프트웨어를 작성하기 위한 형식언어. 
 고급 언어일수록 사람이 사용하는 언어에 가깝다.
프로그래밍 언어- 저급어와 고급어로 나뉘며 고급어로 갈수록 우리가 쓰는 언어에 가까우며 
 저급어는 컴퓨터가 이해하기 쉬운 이진법으로 이루어져있다.
코딩 < 프로그래밍 < 소프트웨어 개발
코딩 - 단순히 프로그래밍 언어를 가지고 코드를 작성하는 행위
프로그래밍 - 프로그램의 목적과 기획의도에 따라 프로그램을 만드는 일련의 과정
소프트웨어 개발 - 프로그램의 목적과 기획 의도를 포함한 사용자의 요구나 시장의 목표를 달성하기 위해 
 프로그램을 제품 및 서비스의 형태로 출시하는 일련의 과정
EX) 코딩 = 사냥행위 
프로그래밍 = 사냥을 해서 경험치를 올리고,  좋은 아이템을 획득해서 주어지는 미션을 수행하는 과정
소프트웨어 개발  = 게임의 세계관을 이해하고 각 직업마다 부여하는 능력들을 얻으러 부지런히 경험치를 쌓으며 
 게임 속 주체로서 성장해 나가서 나름대로의 위체에서 상위 랭커가 되는 과정
데이터 리터러시 
 데이터 수집 (웹페이지 crawling, 웹 로그, 공정 센서, 설문 조사, 인터뷰)
 데이터 관리 (데이터베이스, 데이터 저장, 조회, 생성, 삭제)
 데이터 가공 및 분석 (데이터 전처리, 모델 설계, 모델 평가)
 데이터 시각화 (한정된 공간, 지면에 효과적으로 데이터를 보여주는 능력)
 데이터 기획 (주어진 데이터를 가지고 어떤 문제를 해결할 것인가, 혹은 
  어떤 문제를 해결하기 위해 어떤 데이터를 수집해야하는가를 포함)
  --- 데이터 리터러시 = 데이터를 읽고 쓸 수 있는 능력 ---
 """

"""
Python 기본 문법 

변수 타입 - 숫자 - 정수형(Interger)
              - 소수(float)
              - 복소수(complex number)
        - 문자열(string)
        - 참거짓(Boolean)
        - 배열(list)
        - 튜플(tuple)
        - 셋 (set)
        - 딕셔너리 (dictionary)

int(interger) : 정수입니다.
float(floating-point number) : 실수입니다.
complex number : 복소수입니다.
str(string) : 문자열입니다.
boolean : 참, 거짓 두가지 값을 표현합니다.
list : 순서가 있는 값들의 집합입니다.
tuple : 리스트와 같이 순서가 있는 값들의 집합이지만 읽기전용입니다.
set : 순서가 없고 중복되지 않는 값들의 집합입니다.
dict(dictionary) : 키와 값의 쌍으로 데이터를 저장합니다.

변수 타입이 중요한 이유 - 변수 타입이 다른 경우 연산이 진행되지 않을 수 있다.
 ex) "3" 과 3은 서로 다른 변수 타입을 가지고 있어 "3"을 a 3을 b라고 가정했을때
 a+b는 성립되지 않는다.

 
 수치 연산자

 x + y : 두 값을 더합니다.
 x - y : x에서 y를 뺍니다.
 x * y : 두 값을 곱합니다.
 x / y : x에서 y를 나눕니다.
 x // y : x에서 y를 나눈 몫을 반환합니다.
 x % y : x에서 y를 나눈 나머지를 반환합니다.
 abs(x) : 절대값을 반환합니다.
 int(x) : 숫자 문자열이나 실수를 정수로 변환합니다.
 float(x) : 숫자 문자열이나 정수를 실수로 변환합니다.
 pow(x,y) : x의 y승 값을 반환합니다.
 x ** y  : x의 y승 값을 반환합니다.

 비교 연산자 

 <  : 작다
 <= : 작거나 같다
 >  : 크다
 >= : 크거나 같다
 == : 같다
 != : 다르다
 is : 동일한 객체이다
 is not : 동일한 객체가 아니다 

 """

